sim/analysis/amr/1000000/ngP_02_02_1_4_4/250_40_1/0.orig/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

//internalField   uniform 0.22781;
internalField   uniform 0.226; // from Marcantoni


boundaryField
{
	inlet
	{
	    type            fixedValue;
	    value           uniform 0.0;
	}
	top
	{
	    type            fixedValue;
	    value           uniform 0.0;
	}
	bottom
        {
            type            fixedValue;
            value           uniform 0.0;
        }
	outlet
	{
	    type            inletOutlet;
	    inletValue      uniform 0.0;
	    value           uniform 0.0;
	}
	frontAndBack
	{
	    type            fixedValue;
		value			uniform 0.0;
	}
}


// ************************************************************************* //
